Repository: pingfangx/TranslatorX-other
Catalog: AndroidDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Beware that these methods may not be able to calculate adapter positions if notifyDataSetChanged() has been called and new layout has not yet been calculated.
zh_cn: 注意这些方法可能无法计算 adapter 的位置，当调用了 notifyDataSetChanged() 且新的布局还没有被计算时。

source: Beware that this is a linear search, unlike lookups by key, and that multiple keys can map to the same value and this will find only one of them.
zh_cn: 请注意，这是一个线性搜索，与按键查找不同，多个键可以映射到同一个值，而这将只找到其中一个键。

source: Beyond this lesson, you can find additional related information at Canvas and Drawables.
zh_cn: 除本课程外，你还可以在 Canvas and Drawables 中找到其他相关信息。

source: Beyond this lesson, you can find additional related information at Input Events and Property Animation.
zh_cn: 除本课程外，你还可以在 Input Events 和 Property Animation 中找到其他相关信息。

source: Beyond this lesson, you can find additional, related information in Custom Components.
zh_cn: 除本课程外，你还可以在 Custom Components 中找到其他相关信息。

source: Bias
zh_cn: 偏心

source: Bit of getMeasuredWidthAndState() and getMeasuredWidthAndState() that indicates the measured size is smaller that the space the view would like to have.
zh_cn: getMeasuredWidthAndState() 和 getMeasuredWidthAndState() 的位，表示测量的尺寸小于 view 的空间期望。

source: Bit shift of MEASURED_STATE_MASK to get to the height bits for functions that combine both width and height into a single int, such as getMeasuredState() and the childState argument of resolveSizeAndState(int, int, int).
zh_cn: 位移 MEASURED_STATE_MASK 以获得将宽度和高度组合成单个 int 的函数的高度位，例如 getMeasuredState() 和 resolveSizeAndState(int, int, int)。

source: Bitmap containing the image.
zh_cn: 包含图像的位图。

source: BitmapRegionDecoder can be used to decode a rectangle region from an image.
zh_cn: BitmapRegionDecoder 可用于解码图像中的一个矩形区域。

source: BitmapRegionDecoder is particularly useful when an original image is large and you only need parts of the image.
zh_cn: 当原始图像很大并且你只需要部分图像时，BitmapRegionDecoder 特别有用。

source: BitmapRegionDecoder support for inBitmap was introduced in JELLY_BEAN.
zh_cn: 在 JELLY_BEAN 中引入了对 inBitmap 的 BitmapRegionDecoder 支持。

source: BitmapRegionDecoder will draw its requested content into the Bitmap provided, clipping if the output content size (post scaling) is larger than the provided Bitmap.
zh_cn: BitmapRegionDecoder 将其请求的内容绘制到提供的位图中，如果输出内容大小(后缩放)大于提供的位图，则剪切。

source: Bitmaps in other configurations without an embedded color space are assumed to be in the sRGB color space.
zh_cn: 假设其他配置中没有嵌入颜色空间的位图位于 sRGB 颜色空间中。

source: Bits of getMeasuredWidthAndState() and getMeasuredWidthAndState() that provide the actual measured size.
zh_cn: getMeasuredWidthAndState() 和 getMeasuredWidthAndState() 的位，提供实际测量的大小。

source: Bits of getMeasuredWidthAndState() and getMeasuredWidthAndState() that provide the additional state bits.
zh_cn: getMeasuredWidthAndState() 和 getMeasuredWidthAndState() 的位，提供附加的状态位。

source: Blending mode used to apply the background tint.
zh_cn: 混合模式用于应用背景着色器。

source: Blending mode used to apply the button graphic tint.
zh_cn: 混合模式用于应用按钮图形色调。

source: Blending mode used to apply the check mark tint.
zh_cn: 混合模式用于应用复选标记色调。

source: Blending mode used to apply the foreground tint.
zh_cn: 混合模式用于应用前景着色器。

source: Blending mode used to apply the image tint.
zh_cn: 混合模式用于应用图像色调。

source: Blending mode used to apply the indeterminate progress indicator tint.
zh_cn: 混合模式用于应用不确定的进度指示器色调。

source: Blending mode used to apply the progress indicator background tint.
zh_cn: 混合模式用于应用进度指示器背景色调。

source: Blending mode used to apply the progress indicator tint.
zh_cn: 混合模式用于应用进度指示器色调。

source: Blending mode used to apply the secondary progress indicator tint.
zh_cn: 混合模式用于应用辅助进度指示器色调。

source: Blending mode used to apply the thumb tint.
zh_cn: 混合模式用于应用 thumb 色调。

source: Blending mode used to apply the tick mark tint.
zh_cn: 混合模式用于应用刻度标记色调。

source: Blending mode used to apply the track tint.
zh_cn: 混合模式用于应用轨道色调。

source: Blending modes
zh_cn: 混合模式

source: Blocking screen drawing on disk, or network I/O.
zh_cn: 因磁盘或网络 I/O 阻塞屏幕绘制。

source: Boolean internal attribute to adjust view layout based on system windows such as the status bar.
zh_cn: 布尔内部属性，用于根据系统窗口(如状态栏)调整 view 布局。

source: Boolean that controls whether a view can take focus while in touch mode.
zh_cn: 布尔值，用于控制 view 在触摸模式下是否可以获得焦点。

source: Boolean that controls whether a view should have haptic feedback enabled for events such as long presses.
zh_cn: 布尔值，用于控制 view 是否应为长按等事件启用触觉反馈。

source: Boolean that controls whether a view should have sound effects enabled for events such as clicking and touching.
zh_cn: 布尔值，用于控制 view 是否应为单击和触摸等事件启用声音效果。

source: Both the consumed and unconsumed portions of the scroll distance are reported to the ViewParent.
zh_cn: 滚动距离的消耗和未消耗部分都报告给 ViewParent。

source: Bottom navigation bars make it easy for users to explore and switch between top-level views in a single tap.
zh_cn: 底部导航栏使用户可以轻松浏览并在一次点击中切换顶级 view。

source: Braces do not go on their own line; they go on the same line as the code before them:
zh_cn: 左大括号不单独占一行，与其前面的代码位于同一行：

source: But if the animation is based on ObjectAnimator or if the ItemAnimator uses "pending runnable" and the ViewPropertyAnimation has not started yet, the ItemAnimatior on the view may not be cleared.
zh_cn: 但是，如果动画基于 ObjectAnimator，或者如果 itemaniator 使用“pending runnable”，并且 ViewPropertyAnimation 尚未启动，则可能不会清除 view 上的 itemaniatior。

source: But in terms of the layout computations, GONE widgets are still part of it, with an important distinction:
zh_cn: 但是在布局计算方面，GONE 的小部件仍然是它的一部份，有一个重要的区别：

source: But instead, we just extend the timeout here, in case the classification stays ambiguous.
zh_cn: 但是，我们只是在这里延长超时，以防分类不明确。

source: Buttons can also be added to this view group programmatically via the addView(View) methods.
zh_cn: 也可以通过 addView(View) 方法以编程方式将按钮添加到此 view 组。

source: Buttons can be added to this view group via XML, as follows:
zh_cn: 可以通过 XML 将按钮添加到此 view 组，如下所示：

source: By changing the LayoutManager a RecyclerView can be used to implement a standard vertically scrolling list, a uniform grid, staggered grids, horizontally scrolling collections and more.
zh_cn: 通过改变 LayoutManager，RecyclerView 可以用来实现一个标准的竖直滚动列表，一个标准的表格，交错的网格，水平滚动的集合，等等。

source: By default a document created by FLAG_ACTIVITY_NEW_DOCUMENT will have its entry in recent tasks removed when the user closes it (with back or however else it may finish()).
zh_cn: 默认情况下，由 FLAG_ACTIVITY_NEW_DOCUMENT 创建的文档在用户关闭时(使用 back 或其他方式，它可能 finish())将移除其在最近任务中的条目。

source: By default it will display the current timer value in the form "MM:SS" or "H:MM:SS", or you can use setFormat(String) to format the timer value into an arbitrary string.
zh_cn: 默认情况下，它将以“MM:SS”或“H:MM:SS”的形式显示当前计时器值，或者你可以使用 setFormat(String) 进行格式化将计时器值转换为任意字符串。

source: By default these values are not cached.
zh_cn: 默认这些值是不缓存的。

source: By default, ImageDecoder will create a Bitmap with premultiplied pixels, which is required for drawing with the View system (i.e. to a Canvas).
zh_cn: 默认情况下，ImageDecoder 将使用预乘像素创建 Bitmap，这是使用 View 系统进行绘制所必需的(即到 Canvas)。

source: By default, TextView's layout rendering sets the text padding in LTR on initial rendering and it only renders correctly after the layout has been invalidated so you need to ensure that initial rendering has the correct layout.
zh_cn: 默认情况下，TextView 的布局渲染在初始渲染时设置 LTR 中的文本填充，并且只有在布局失效后才能正确渲染，因此你需要确保初始渲染具有正确的布局。

source: By default, VideoView requests audio focus with AudioManager#AUDIOFOCUS_GAIN.
zh_cn: 默认情况下，VideoView 使用 AudioManager#AUDIOFOCUS_GAIN 请求音频焦点。

source: By default, Views are created using the theme of the Context object supplied to their constructor; however, a different theme may be specified by using the android:theme attribute in layout XML or by passing a ContextThemeWrapper to the constructor from code.
zh_cn: 默认情况下，view 使用提供给它们的构造函数的 Context 对象的主题来创建，然而，也可以申明不同的主题，在 XML 文件中使用 android:theme 属性或在代码中给构造方法传递一个 ContextThemeWrapper。

source: By default, a Bitmap created by ImageDecoder (including one that is inside a Drawable) will be immutable (i.e. Bitmap.isMutable() returns false), and it will typically have Config Bitmap.Config.HARDWARE.
zh_cn: 默认情况下，由 ImageDecoder 创建的 Bitmap（包括 Drawable 内部的那个）将是不可变的（即 Bitmap.isMutable() 返回 false），它通常会有 Config Bitmap.Config.HARDWARE。

source: By default, a Bitmap created by decodeBitmap will be immutable i.e. Bitmap.isMutable() returns false.
zh_cn: 默认情况下，由 decodeBitmap 创建的 Bitmap 将是不可变的，即 Bitmap.isMutable() 返回 false。

source: By default, an ImageButton looks like a regular Button, with the standard button background that changes color during different button states.
zh_cn: 默认情况下，ImageButton 看起来像常规 Button，标准按钮背景在不同的按钮状态下会更改颜色。

source: By default, each item occupies 1 span.
zh_cn: 默认的，每一个 item 占据 1 个 span。

source: By default, the chips are reflowed across multiple lines.
zh_cn: 默认情况下，chip 在多行上回流。

source: By default, the output size will match the size of the encoded image, which can be retrieved from the ImageInfo in onHeaderDecoded.
zh_cn: 默认情况下，输出大小将匹配编码图像的大小，可以从 onHeaderDecoded 中的 ImageInfo 检索编码图像的大小。

source: By default, the progress bar is full when the progress value reaches 100.
zh_cn: 默认情况下，当进度值达到 100 时，进度条已满。

source: By default, the region contains all of the matcher's input.
zh_cn: 默认情况下，此区域包含全部的匹配器输入。

source: By default, the space is evenly distributed between each view that's set to "match constraints," but you can assign a weight of importance to each view using the layout_constraintHorizontal_weight and layout_constraintVertical_weight attributes.
zh_cn: 默认情况下，空间均匀分布在设置为 "match constraints" 的每个 view 之间，但是你可以使用 layout_constraintHorizontal_weight 和 layout_constraintVertical_weight 属性为每个 view 分配一个重要性权重。

source: By doing so, you increase the readability and maintainability of your code and reduce the likelihood of error.
zh_cn: 这样做有助于提高代码的可读性和可维护性，并降低出错的可能性。

source: By returning true from this method, the parent indicates that the child should not fling its own internal content as well.
zh_cn: 通过从此方法返回 true，父级指示子级也不应该 fling 他自己的内部内容。

source: By specifying Behaviors for child views of a CoordinatorLayout you can provide many different interactions within a single parent and those views can also interact with one another.
zh_cn: 通过为 CoordinatorLayout 的子 view 指定 Behaviors，你可以在单个父级中提供许多不同的交互，并且这些 view 也可以相互交互。

source: By using api version specific resource values, you can avoid these changes.
zh_cn: 通过使用 api 版本特定的资源值，你可以避免这些更改。

source: CDATA sections are used to escape blocks of text containing characters that would otherwise be regarded as markup.
zh_cn: CDATA 部分用于转义包含字符的文本块，否则这些字符将被视为标记。

source: CDATA sections cannot be nested.
zh_cn: CDATA 部分不能嵌套。

source: Calculate a MeasureSpec value for measuring a child view in one dimension.
zh_cn: 计算 MeasureSpec 值以在一个单位内测量子 view。

source: Calculate positions, dimensions, and any other values related to your view's size in onSizeChanged(), instead of recalculating them every time you draw.
zh_cn: 在 onSizeChanged() 中计算与 view 大小相关的位置，尺寸和任何其他值，而不是每次绘制时重新计算它们。

source: Calculate the size of a view in 0 dp by reducing the constrains gaps as much as possible
zh_cn: 通过尽可能减少约束空位来计算 0dp 的 view 的大小。

source: Calculates the bounding box of the View while taking into account its matrix changes (translation, scale etc) with respect to the RecyclerView.
zh_cn: 计算指定 view 的边界盒子，当考虑到 RecyclerView 相应的矩阵发生变化时(移动、缩放等)。

source: Calculates the item decor insets applied to the given child and updates the provided Rect instance with the inset values.
zh_cn: 计算 item 装饰的内缩值，应用给指定的 child，并且用内缩值更新提供的 Rect 实例。

source: Call postInvalidate() after calling fling(), in order to force a redraw.
zh_cn: 在调用 fling() 之后调用 postInvalidate()，以强制重绘。

source: Call getCurrX() and getCurrY() to retrieve these values.
zh_cn: 调用 getCurrX() 和 getCurrY() 来获取这些值。

source: Call isInTouchMode() to see whether the device is currently in touch mode.
zh_cn: 调用 isInTouchMode() 以查看设备当前是否处于触摸模式。

source: Call setShader() to use your LinearGradient on filled shapes.
zh_cn: 调用 setShader() 在填充的形状上使用 LinearGradient。

source: Call the method Context.grantUriPermission(package, Uri, mode_flags) for the content:// Uri, using the desired mode flags.
zh_cn: 为 content:// Uri 调用 Context.grantUriPermission(package, Uri, mode_flags) 方法，使用所需的模式标志。

source: Call this to create a new shader that will draw with a bitmap.
zh_cn: 调用它来创建一个新的着色器，该着色器将使用位图进行绘制。

source: Call this to remove all cached loaded layout resources from the Resources object.
zh_cn: 调用此方法可从 Resources 对象中移除所有缓存的已加载布局资源。

source: Call this view's OnClickListener, if it is defined.
zh_cn: 调用此 view 的 OnClickListener，如果它被定义。

source: Call this when something has changed which has invalidated the layout of this view.
zh_cn: 当有东西改变使该 view 的布局无效时调用。

source: Call this when you want to 'spring back' into a valid coordinate range.
zh_cn: 当你想要“回弹”到有效坐标范围时，请调用此方法。

source: Call this when you want to know the new location.
zh_cn: 当你想知道新位置时，请调用此方法。

source: Callback interface for responding to adapter changes.
zh_cn: 用于响应适配器更改的回调接口。

source: Callback interface for responding to changing state of the selected page.
zh_cn: 回调接口，用于响应所选页面的更改状态。

source: Callback interface for selection events on suggestions.
zh_cn: 用于建议选择事件的回调接口。

source: Callback interface invoked when a tab's selection state changes.
zh_cn: 选项卡的选择状态更改时调用回调接口。

source: Callback interface invoked when the view's EditText is attached, or from addOnEditTextAttachedListener(OnEditTextAttachedListener) if the edit text is already present.
zh_cn: 附加 view 的 EditText 时调用的回调接口，或者从 addOnEditTextAttachedListener(OnEditTextAttachedListener) 如果编辑文本已经存在。

source: Callback interface invoked when the view's end icon changes.
zh_cn: view 的结束图标更改时调用回调接口。

source: Callback interface supplied to WebView.postVisualStateCallback(long, WebView.VisualStateCallback) for receiving notifications about the visual state.
zh_cn: 回调接口提供给 WebView.postVisualStateCallback(long, WebView.VisualStateCallback)，用于接收有关可视状态的通知。

source: Callback invoked when the drawer is closed.
zh_cn: 抽屉关闭时调用回调。

source: Callback invoked when the drawer is opened.
zh_cn: 打开抽屉时调用回调。

source: Callback invoked when the drawer is scrolled.
zh_cn: 滚动抽屉时调用回调。

source: Callback to be invoked when the visibility of a FloatingActionButton changes.
zh_cn: 当 FloatingActionButton 的可见性更改时，将调用回调。

source: Callback used to receive time shift position changes.
zh_cn: 回调用于接收时移位置变化。

source: Callback used to receive various status updates on the TvView.
zh_cn: 回调用于在 TvView 上接收各种状态更新。

source: Callbacks for changes to the query text.
zh_cn: 回调查询文本的更改。

source: Called after a view and all of its children has been inflated from XML.
zh_cn: 在一个 View 及其所有子 view 从 XML 加载完成后被调用。

source: Called by ImageDecoder when the header has been decoded and the image size is known.
zh_cn: 当 header 已被解码并且图像大小已知时，由 ImageDecoder 调用。

source: Called by ImageDecoder when there is only a partial image to display.
zh_cn: 当只有部分图像要显示时，由 ImageDecoder 调用。

source: Called by RecyclerView to display the data at the specified position.
zh_cn: 由 RecyclerView 调用以在指定位置显示数据。

source: Called by RecyclerView when it starts observing this Adapter.
zh_cn: 当 RecyclerView 开始观察此适配器时调用。

source: Called by RecyclerView when it stops observing this Adapter.
zh_cn: 当 RecyclerView 停止观察此适配器时调用。

source: Called by the RecyclerView if a ViewHolder created by this Adapter cannot be recycled due to its transient state.
zh_cn: 如果此适配器创建的 ViewHolder 由于其暂时状态而无法回收，则由 RecyclerView 调用。

source: Called by the garbage collector on an object when garbage collection determines that there are no more references to the object.
zh_cn: 当垃圾收集确定没有更多对该对象的引用时，由对象上的垃圾回收器调用。

source: Called by zygote when it is done preloading resources, to change back to normal Resources operation.
zh_cn: 当它完成预加载资源时，由 zygote 调用，以更改回正常的资源操作。

source: Called from layout when this view should assign a size and position to each of its children.
zh_cn: 从一个 layout 调用，该 view 应该分配为它所有的子 view 分配大小及位置时调用。

source: Called to determine the size requirements for this view and all of its children.
zh_cn: 调用以确认 view 及其子 view 所需求的尺寸大小。

source: Called to inform the adapter of which item is currently considered to be the "primary", that is the one show to the user as the current page.
zh_cn: 调用以通知 adapter 哪一个 item 当前被认为是 "primary" 的，它是显示给用户作为当前页面的 item。

source: Called to lay out each individual child view unless a Behavior is present.
zh_cn: 除非存在 Behavior，否则调用此布局每个子 view。

source: Called to measure each individual child view unless a Behavior is present.
zh_cn: 除非存在 Behavior，否则调用以测量每个子 view。

source: Called when RecyclerView needs a new ViewHolder of the given type to represent an item.
zh_cn: 当 RecyclerView 需要指定类型的新 ViewHolder 来表示项时调用。

source: Called when a change in the shown pages is going to start being made.
zh_cn: 当显示页面的更改将要开始时调用。

source: Called when a child does not want this parent and its ancestors to intercept touch events with onInterceptTouchEvent(MotionEvent).
zh_cn: 当一个子 view 不想它的 parent 及祖先 view 通过 onInterceptTouchEvent(MotionEvent) 拦截事件时调用该方法。

source: Called when a child of the view associated with this behavior wants a particular rectangle to be positioned onto the screen.
zh_cn: 当与此行为关联的 view 的子项想要将特定矩形定位到屏幕上时调用。

source: Called when a child of this group wants a particular rectangle to be positioned onto the screen.
zh_cn: 当该 view group 的一个子 view 想要一个特定的矩形来定位到屏幕上时调用。

source: Called when a child of this parent wants focus
zh_cn: 当该 parent 的一个子 view 想要获取焦点时调用。

source: Called when a descendant of the CoordinatorLayout attempts to initiate a nested scroll.
zh_cn: 当 CoordinatorLayout 的后代尝试启动嵌套滚动时调用。

source: Called when a hardware key up event occurs.
zh_cn: 发生硬件 key up 事件时调用。

source: Called when a key up event occurs.
zh_cn: 当按键弹起时调用。

source: Called when a nested scroll has been accepted by the CoordinatorLayout.
zh_cn: 当 CoordinatorLayout 接受嵌套滚动时调用。

source: Called when a nested scroll has ended.
zh_cn: 嵌套滚动结束时调用。

source: Called when a nested scroll in progress has updated and the target has scrolled or attempted to scroll.
zh_cn: 当正在进行的嵌套滚动已更新且目标已滚动或尝试滚动时调用。

source: Called when a nested scroll in progress is about to update, before the target has consumed any of the scrolled distance.
zh_cn: 在目标消耗任何滚动距离之前，当正在进行的嵌套滚动即将更新时调用。

source: Called when a nested scrolling child is about to start a fling.
zh_cn: 当嵌套的滚动子项即将开始抛掷时调用。

source: Called when a nested scrolling child is starting a fling or an action that would be a fling.
zh_cn: 当嵌套的滚动子项开始投掷或动作将是投掷时会调用。

source: Called when a new hardware key event occurs.
zh_cn: 当发生新的硬件按键事件时调用。

source: Called when a new key event occurs.
zh_cn: 当一个新的按键事件发生时调用。

source: Called when a touch screen motion event occurs.
zh_cn: 当发生触摸屏运动事件时调用。

source: Called when a trackball motion event occurs.
zh_cn: 当轨迹球移动事件发生时调用。

source: Called when a view created by this adapter has been attached to a window.
zh_cn: 当此适配器创建的 view 已附加到窗口时调用。

source: Called when a view created by this adapter has been detached from its window.
zh_cn: 当此适配器创建的 view 与其窗口分离时调用。

source: Called when a view created by this adapter has been recycled.
zh_cn: 当此适配器创建的 view 被回收时调用。

source: Called when a view is set to dodge view insets.
zh_cn: 当 view 设置为闪避 view 插入时调用。

source: Called when an item view is attached to this RecyclerView.
zh_cn: 当一个 item view 添加到该 RecyclerView 时调用。

source: Called when an item view is detached from this RecyclerView.
zh_cn: 当一个 item view 从该 RecyclerView 脱离时调用。Called when an item view is detached from this RecyclerView.

source: Called when the Behavior has been attached to a LayoutParams instance.
zh_cn: 将行为附加到 LayoutParams 实例时调用。

source: Called when the Behavior has been detached from its holding LayoutParams instance.
zh_cn: 当行为已从其持有的 LayoutParams 实例中分离时调用。

source: Called when the a change in the shown pages has been completed.
zh_cn: 当所显示的页面的更改已完成时调用。

source: Called when the hidden state (as returned by isHidden() of the fragment has changed.
zh_cn: 当 Fragment 的隐藏状态(和 isHidden() 返回的一致)改变时调用。

source: Called when the parent CoordinatorLayout is about the lay out the given child view.
zh_cn: 在父级 CoordinatorLayout 将要布局给定子 view 时调用。

source: Called when the parent CoordinatorLayout is about to measure the given child view.
zh_cn: 当父 CoordinatorLayout 即将测量给定的子 view 时调用。

source: Called when the scroll state of this RecyclerView changes.
zh_cn: 当该 RecyclerView 的滚动状态改变时调用。

source: Called when the size of this view has changed.
zh_cn: 当 view 的尺寸发生变化时调用。

source: Called when the view gains or loses focus.
zh_cn: 当 view 获得或失去焦点时调用。

source: Called when the view is attached to a window.
zh_cn: 当 view 附加到窗体上时调用。

source: Called when the view is detached from its window.
zh_cn: 当 view 从窗体上取消附加时调用。

source: Called when the view should render its content.
zh_cn: 当 view 应渲染内容时调用。

source: Called when the visibility of the window containing the view has changed.
zh_cn: 当容纳该 view 的窗体的可见性发生变化时调用。

source: Called when the window containing the view gains or loses focus.
zh_cn: 当容纳该 view 的窗体获得或失去焦点时调用。

source: Called when the window insets have changed.
zh_cn: 窗口插入更改时调用。

source: Called when this view should assign a size and position to all of its children.
zh_cn: 当 view 为其所有子 view 指定大小和位置时调用。

source: Calling the superclass' onMeasure(int, int) is a valid use.
zh_cn: 调用父类的 onMeasure(int, int) 是一个可用的方法。

source: Calling this method is mandatory.
zh_cn: 调用此方法是必需的。

source: Calling this method with a value of true will result in decodeBitmap(ImageDecoder.Source) returning a Bitmap with unpremultiplied pixels.
zh_cn: 使用值 true 调用此方法将导致 decodeBitmap(ImageDecoder.Source) 返回 Bitmap 具有未经倍增的像素。

source: Calling this will notify the decoder that it should cancel its operation.
zh_cn: 调用它将通知解码器它应该取消它的操作。

source: Calls constructors.
zh_cn: 调用构造函数。

source: Calls the callback method, such as Activity.onCreate(), appropriate to the current lifecycle state of the activity.
zh_cn: 调用适合于 activity 当前生命周期状态的回调方法，例如 Activity.onCreate()。

source: Calls this view's OnLongClickListener, if it is defined.
zh_cn: 调用此 view 的 OnLongClickListener(如果已定义)。

source: Can be empty list if requires full update.
zh_cn: 如果需要完全更新，则可以为空列表。

source: Cancel touch targets if necessary.
zh_cn: 如果需要，取消触摸目标。

source: CardView layout for views that can react to an ExpandableWidget's setExpanded(boolean) state changes by transforming the ExpandableWidget into itself.
zh_cn: 用于 view 的 CardView 布局，通过将 ExpandableWidget 装入自己，这些 view 可以对 ExpandableWidget 的 setExpanded(boolean) 状态做出反应。

source: CardView uses elevation property on Lollipop for shadows and falls back to a custom emulated shadow implementation on older platforms.
zh_cn: CardView 在 Lollipop 上使用 elevation 属性来获取阴影，然后回退到旧平台上的自定义模拟阴影实现。

source: CardView will use elevation API on Lollipop and before Lollipop, it will change the shadow size.
zh_cn: CardView 将在 Lollipop 上使用高程 API，在 Lollipop 之前，它将更改阴影大小。

source: Cards also have a custom state meant to be used when a card is draggable app:dragged_state.
zh_cn: 卡片也有一个自定义状态，可以在卡片可拖动时使用 app:dragged_state。

source: Cards implement Checkable, a default way to switch to android:checked_state is not provided.
zh_cn: 卡实现 Checkable，未提供切换到 android:checked_state 的默认方式。

source: Catch each exception separately as separate catch blocks after a single try.
zh_cn: 在单个 try 之后将每个异常作为单独的 catch 块分别进行捕获。

source: Catch the Exception and throw a new RuntimeException.
zh_cn: 捕获异常并抛出一个新的 RuntimeException。

source: Category
zh_cn: 分类

source: Causes the current thread to wait until another thread invokes the notify() method or the notifyAll() method for this object, or some other thread interrupts the current thread, or a certain amount of real time has elapsed.
zh_cn: 使当前线程等待，直到另一个线程对此对象调用 notify() 方法或 notifyAll() 方法或其他线程中断当前线程，或者经过一定的实时时间。

source: Causes the current thread to wait until another thread invokes the notify() method or the notifyAll() method for this object.
zh_cn: 使当前线程等待，直到另一个线程对此对象调用 notify() 方法或 notifyAll() 方法。
